In [1]:
import numpy as np

In [2]:
import pandas as pd

In [4]:
names = pd.Series(['Elyorbek','Ilyos','Shohruh','Dilmurod','Ahmadjon','5'])

In [5]:
names

0    Elyorbek
1       Ilyos
2     Shohruh
3    Dilmurod
4    Ahmadjon
5           5
dtype: object

In [6]:
names.str.upper()

0    ELYORBEK
1       ILYOS
2     SHOHRUH
3    DILMUROD
4    AHMADJON
5           5
dtype: object

In [8]:
email = 'pro100elly@gmail.com'

In [9]:
email.isdigit()

False

In [11]:
names.str.len()

0    8
1    5
2    7
3    8
4    8
5    1
dtype: int64

In [12]:
messy_names = pd.Series(['andrew  ','bo;bo','   claire  '])

In [13]:
messy_names

0       andrew
1          bo;bo
2       claire
dtype: object

In [17]:
messy_names.str.replace(';','').str.strip().str.capitalize()

0    Andrew
1      Bobo
2    Claire
dtype: object

In [22]:
def cleanup(name):
    name = name.replace(';','')
    name = name.strip()
    name = name.capitalize()
    return name

In [19]:
m2_names = pd.Series(['elyy    ','bo;bo','      aaaaa      '])

In [20]:
m2_names

0             elyy
1                bo;bo
2          aaaaa
dtype: object

In [23]:
m2_names.apply(cleanup)

0     Elyy
1     Bobo
2    Aaaaa
dtype: object

In [24]:
from datetime import datetime

In [25]:
myser = pd.Series(['Nov 3, 2000','2000-01-01',None])

In [31]:
pd.to_datetime(myser[0])

Timestamp('2000-11-03 00:00:00')

In [28]:
timeser = pd.to_datetime(myser)

In [29]:
timeser[0].year

2000

In [30]:
pd.to_datetime(pd.Series(['21 December,2021']))

0   2021-12-21
dtype: datetime64[ns]

In [32]:
sales = pd.read_csv('C:\\Users\\User\\jupyter-noutbooks\\03-Pandas\\RetailSales_BeerWineLiquor.csv')

In [33]:
sales

           DATE  MRTSSM4453USN
0    1992-01-01           1509
1    1992-02-01           1541
2    1992-03-01           1597
3    1992-04-01           1675
4    1992-05-01           1822
..          ...            ...
335  2019-12-01           6630
336  2020-01-01           4388
337  2020-02-01           4533
338  2020-03-01           5562
339  2020-04-01           5207

[340 rows x 2 columns]

In [39]:
sales['DATE'] = pd.to_datetime(sales['DATE'])

In [40]:
sales

          DATE  MRTSSM4453USN
0   1992-01-01           1509
1   1992-02-01           1541
2   1992-03-01           1597
3   1992-04-01           1675
4   1992-05-01           1822
..         ...            ...
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[340 rows x 2 columns]

In [41]:
sales['DATE']

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [51]:
sales = pd.read_csv('C:\\Users\\User\\jupyter-noutbooks\\03-Pandas\\RetailSales_BeerWineLiquor.csv',parse_dates=[0])

In [53]:
sales

          DATE  MRTSSM4453USN
0   1992-01-01           1509
1   1992-02-01           1541
2   1992-03-01           1597
3   1992-04-01           1675
4   1992-05-01           1822
..         ...            ...
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[340 rows x 2 columns]

In [54]:
sales['DATE']

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [56]:
sales = sales.set_index('DATE')

In [48]:
sales['DATE']

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [57]:
sales.resample(rule='A').mean()

            MRTSSM4453USN
DATE
1992-12-31    1807.250000
1993-12-31    1794.833333
1994-12-31    1841.750000
1995-12-31    1833.916667
1996-12-31    1929.750000
1997-12-31    2006.750000
1998-12-31    2115.166667
1999-12-31    2206.333333
2000-12-31    2375.583333
2001-12-31    2468.416667
2002-12-31    2491.166667
2003-12-31    2539.083333
2004-12-31    2682.416667
2005-12-31    2797.250000
2006-12-31    3001.333333
2007-12-31    3177.333333
2008-12-31    3292.000000
2009-12-31    3353.750000
2010-12-31    3450.083333
2011-12-31    3532.666667
2012-12-31    3697.083333
2013-12-31    3839.666667
2014-12-31    4023.833333
2015-12-31    4212.500000
2016-12-31    4434.416667
2017-12-31    4602.666667
2018-12-31    4830.666667
2019-12-31    4972.750000
2020-12-31    4922.500000